tests/mutants/patches/land-gate-output-inherits-stdout.patch
diff --git a/scripts/land.sh b/scripts/land.sh
index fb627b1..73fcbef 100755
--- a/scripts/land.sh
+++ b/scripts/land.sh
@@ -248,7 +248,7 @@ run_gates() {
   # verify.sh report to it, so `land.sh > out` still gets a page of test output
   # instead of the summary. Measured on the run that landed this file's previous
   # commit.
-  if ! ( eval "$cmd" 1>&2 ); then
+  if ! ( eval "$cmd" ); then
     rm -f "$GATE_STAMP"
     refuse 4 "Local gates failed." \
       "Fix the failure and re-run scripts/land.sh. Do not weaken the test."
